#ifndef LED_SWITCH
#define LED_SWITCH
//Дата последней редакции: 20 апреля 2025 года

/* ======================== Краткое описание автомата =========================
	Включает/выключает светодиод PC13 командами led 1/0 или led = 1/0.
	Состояние светодиода: 0 - не горит, >=1 - горит. */
	
// ====================== Описание переменных автомата  =======================
enum led_state { // Перечисление состояний автомата
	LED_SWITCH_WORK
};

uint8_t led_state = LED_SWITCH_WORK; // Начальное состояние
uint8_t led_status = 0; // Состояние светодиода (0 - не горит, >=1 - горит)

#endif